In [9]:
#Python Lambda Function with List Comprehension
tables=[lambda x=x:x*10 for x in range(1,11)]
for i in tables:
    print(i())  #Using parenthesis

10
20
30
40
50
60
70
80
90
100

In [8]:
(lambda x=10:x*10)()

100

# Pandas

In [144]:
import numpy as np

import pandas as pd

In [12]:
# Series 
# DataFrame

In [15]:
arr = np.random.randint(1, 100, 10).reshape(2, 5)
arr

array([[60, 41, 80,  7, 96],
       [83, 43, 67, 77, 74]])

In [16]:
arr[0][1]

41

# Series

In [17]:
city_names = ['Mumbai', 'Delhi', 'Chennai', 'Kolkata', 'Bengaluru']
city_names

['Mumbai', 'Delhi', 'Chennai', 'Kolkata', 'Bengaluru']

In [18]:
city_ser = pd.Series(city_names)
city_ser

0       Mumbai
1        Delhi
2      Chennai
3      Kolkata
4    Bengaluru
dtype: object

In [19]:
print(city_ser[2])

Chennai

In [22]:
# arr = np.array([[10,20,30,40]])
# arr.ndim

2

In [23]:
print(city_ser[1:4])

1      Delhi
2    Chennai
3    Kolkata
dtype: object

In [30]:
city_ser = pd.Series(city_names, index = ('a', 'b','c', 'd', 'e'))
city_ser

a       Mumbai
b        Delhi
c      Chennai
d      Kolkata
e    Bengaluru
dtype: object

In [25]:
print(city_ser[2])

Chennai

In [27]:
print(city_ser['c'])

Chennai

In [28]:
print(city_ser['b':'d'])

b      Delhi
c    Chennai
d    Kolkata
dtype: object

In [31]:
country_curr_lst = {'India':'INR', 'Russia':'Rubble', 'USA':'Dollar'}
country_curr_lst

{'India': 'INR', 'Russia': 'Rubble', 'USA': 'Dollar'}

In [35]:
country_curr_ser = pd.Series(country_curr_lst)
country_curr_ser['Canada'] = 'CD'
country_curr_ser

India        INR
Russia    Rubble
USA       Dollar
Canada        CD
dtype: object

In [36]:
city_ser.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [37]:
city_ser.values

array(['Mumbai', 'Delhi', 'Chennai', 'Kolkata', 'Bengaluru'], dtype=object)

In [ ]:
# Dataframe - rows and Columns

In [38]:
df = pd.DataFrame(city_names)
df

           0
0     Mumbai
1      Delhi
2    Chennai
3    Kolkata
4  Bengaluru

In [43]:
# Creating a dataframe out of dictionary

my_dict = {'emp_name' : ['Abhishek', 'Krishna', 'Aditya', 'Aniket'],
           'emp_id':[101, 102, 103, 104],
           'emp_sal':[10000, 20000, 30000, 40]}

my_dict

{'emp_name': ['Abhishek', 'Krishna', 'Aditya', 'Aniket'],
 'emp_id': [101, 102, 103, 104],
 'emp_sal': [10000, 20000, 30000, 40]}

In [44]:
df = pd.DataFrame(my_dict)
df

   emp_name  emp_id  emp_sal
0  Abhishek     101    10000
1   Krishna     102    20000
2    Aditya     103    30000
3    Aniket     104       40

In [46]:
list_tuples = [('Abhishek', 'Krishna', 'Aditya', 'Aniket'),
               (101, 102, 103, 104),
               (10000, 20000, 30000, 40)]
list_tuples

[('Abhishek', 'Krishna', 'Aditya', 'Aniket'),
 (101, 102, 103, 104),
 (10000, 20000, 30000, 40)]

In [48]:
df = pd.DataFrame(list_tuples, index = ['Names', 'ID', "sal"])
df

              0        1       2       3
Names  Abhishek  Krishna  Aditya  Aniket
ID          101      102     103     104
sal       10000    20000   30000      40

In [49]:
list_tuples = [('Abhishek', 101, 10000),
               ('Krishna', 102, 20000),
               ('Aditya',103, 30000)]
list_tuples

[('Abhishek', 101, 10000), ('Krishna', 102, 20000), ('Aditya', 103, 30000)]

In [51]:
df = pd.DataFrame(list_tuples, columns = ['Names', 'ID', "sal"])
df

      Names   ID    sal
0  Abhishek  101  10000
1   Krishna  102  20000
2    Aditya  103  30000

In [68]:
df = pd.read_excel('datasets/automobile_camera.xlsx','Automobile', index_col = 0)
df

                    car_name  mpg  horsepower origin_country
0     Toyota Corolla Mark ii   24          95          Japan
1  Chevrolet Chevelle Malibu   18         130             US
2                Audi 100 LS   24          90        Germany
3                   BMW 2002   26         113        Germany
4               Datsun PL510   27          88          Japan

In [69]:
df = pd.read_csv('datasets/apple_stocks.csv')
df

          Date    Open    High     Low   Close    Volume
0     7-Jul-17  142.90  144.75  142.90  144.18  19201712
1     6-Jul-17  143.02  143.50  142.41  142.73  24128782
2     5-Jul-17  143.69  144.79  142.72  144.09  21569557
3     3-Jul-17  144.88  145.30  143.10  143.50  14277848
4    30-Jun-17  144.45  144.96  143.78  144.02  23024107
..         ...     ...     ...     ...     ...       ...
124   9-Jan-17  117.95  119.43  117.94  118.99  33561948
125   6-Jan-17  116.78  118.16  116.47  117.91  31751900
126   5-Jan-17  115.92  116.86  115.81  116.61  22193587
127   4-Jan-17  115.85  116.51  115.75  116.02  21118116
128   3-Jan-17  115.80  116.33  114.76  116.15  28781865

[129 rows x 6 columns]

# Some basic operation on the dataframe

In [70]:
weather_data = pd.read_csv('datasets/weather_data.csv')
weather_data

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [71]:
r, c = weather_data.shape

In [72]:
r

6

In [73]:
c

4

In [74]:
weather_data.index

RangeIndex(start=0, stop=6, step=1)

In [75]:
weather_data.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [77]:
weather_data['temperature'].max()

35

In [78]:
np.max(weather_data['temperature'])

35

In [ ]:
weather_data['temperature'].min()

In [80]:
weather_data['temperature'].dtype

dtype('int64')

In [82]:
weather_data.head(3)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [85]:
weather_data.tail(3)

        day  temperature  windspeed  event
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [88]:
weather_data.describe()['temperature']['mean']

30.333333333333332

# Indexing and Slicing

In [90]:
bike_data = pd.read_csv('datasets/citibike_tripdata.csv')
bike_data.head(10)

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
0,338,2018-05-01 00:04:47,2018-05-01 00:10:25,3639,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
1,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
2,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber
3,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
4,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271,Annual Membership,Subscriber
5,176,2018-05-01 04:37:05,2018-05-01 04:40:01,3194,McGinley Square,3195,Sip Ave,29298,Annual Membership,Subscriber
6,577,2018-05-01 05:05:46,2018-05-01 05:15:23,3225,Baldwin at Montgomery,3186,Grove St PATH,33619,Annual Membership from Citi Bike App,Subscriber
7,830,2018-05-01 05:11:50,2018-05-01 05:25:41,3207,Oakland Ave,3185,City Hall,33624,Annual Membership,Subscriber
8,395,2018-05-01 05:12:07,2018-05-01 05:18:42,3225,Baldwin at Montgomery,3186,Grove St PATH,26300,Annual Membership,Subscriber
9,170,2018-05-01 05:13:52,2018-05-01 05:16:43,3206,Hilltop,3195,Sip Ave,33555,$25 Off Annual Membership,Subscriber

In [91]:
bike_data.tail(10)

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
32418,340,2018-05-30 13:42:45,2018-05-30 13:48:26,3203,Hamilton Park,3199,Newport Pkwy,33652,Annual Membership,Subscriber
32419,307,2018-05-30 13:44:09,2018-05-30 13:49:16,3187,Warren St,3202,Newport PATH,33558,Annual Membership,Subscriber
32420,485,2018-05-30 13:44:46,2018-05-30 13:52:51,3183,Exchange Place,3211,Newark Ave,29534,Annual Membership - Save 15%,Subscriber
32421,255,2018-05-30 13:45:38,2018-05-30 13:49:54,3183,Exchange Place,3213,Van Vorst Park,29443,Annual Membership,Subscriber
32422,108,2018-05-30 13:49:12,2018-05-30 13:51:00,3202,Newport PATH,3199,Newport Pkwy,29461,Annual Membership,Subscriber
32423,396,2018-05-30 13:49:18,2018-05-30 13:55:55,3184,Paulus Hook,3279,Dixon Mills,29639,Join Citi Bike for $14.95/month,Subscriber
32424,313,2018-05-30 13:49:21,2018-05-30 13:54:35,3202,Newport PATH,3639,Harborside,26301,$25 Off Annual Membership,Subscriber
32425,316,2018-05-30 13:49:51,2018-05-30 13:55:08,3220,5 Corners Library,3195,Sip Ave,29260,Annual Membership,Subscriber
32426,1130,2018-05-30 13:50:52,2018-05-30 14:09:42,3281,Leonard Gordon Park,3213,Van Vorst Park,26239,Annual Membership,Subscriber
32427,369,2018-05-30 13:50:58,2018-05-30 13:57:08,3220,5 Corners Library,3207,Oakland Ave,33660,Annual Membership,Subscriber

In [92]:
bike_data.columns

Index(['tripduration', 'starttime', 'stoptime', 'start station id',
       'start station name', 'end station id', 'end station name', 'bikeid',
       'name_localizedValue', 'usertype'],
      dtype='object')

In [93]:
bike_data.head()

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
0,338,2018-05-01 00:04:47,2018-05-01 00:10:25,3639,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
1,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
2,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber
3,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
4,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271,Annual Membership,Subscriber

In [99]:
bike_data['tripduration'][1] = 1400
bike_data

<ipython-input-99-7ad9f91b89d2>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bike_data['tripduration'][1] = 1400

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
0,338,2018-05-01 00:04:47,2018-05-01 00:10:25,3639,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
1,1400,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
2,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber
3,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
4,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271,Annual Membership,Subscriber
...,...,...,...,...,...,...,...,...,...,...
32423,396,2018-05-30 13:49:18,2018-05-30 13:55:55,3184,Paulus Hook,3279,Dixon Mills,29639,Join Citi Bike for $14.95/month,Subscriber
32424,313,2018-05-30 13:49:21,2018-05-30 13:54:35,3202,Newport PATH,3639,Harborside,26301,$25 Off Annual Membership,Subscriber
32425,316,2018-05-30 13:49:51,2018-05-30 13:55:08,3220,5 Corners Library,3195,Sip Ave,29260,Annual Membership,Subscriber
32426,1130,2018-05-30 13:50:52,2018-05-30 14:09:42,3281,Leonard Gordon Park,3213,Van Vorst Park,26239,Annual Membership,Subscriber
32427,369,2018-05-30 13:50:58,2018-05-30 13:57:08,3220,5 Corners Library,3207,Oakland Ave,33660,Annual Membership,Subscriber

In [100]:
bike_data['tripduration'].head()

0     338
1    1400
2     232
3     190
4     303
Name: tripduration, dtype: int64

In [106]:
bike_data[['start station id', 'end station id']].head()

   start station id  end station id
0              3639            3199
1              3681            3185
2              3194            3193
3              3185            3186
4              3207            3195

In [109]:
bike_data[['start station id', 'end station id']]['start station id'][1]

3681

In [110]:
bike_data.at[1, 'start station id']

3681

In [111]:
new_bike_data = bike_data.head(10)
new_bike_data

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
0,338,2018-05-01 00:04:47,2018-05-01 00:10:25,3639,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
1,1400,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
2,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber
3,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
4,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271,Annual Membership,Subscriber
5,176,2018-05-01 04:37:05,2018-05-01 04:40:01,3194,McGinley Square,3195,Sip Ave,29298,Annual Membership,Subscriber
6,577,2018-05-01 05:05:46,2018-05-01 05:15:23,3225,Baldwin at Montgomery,3186,Grove St PATH,33619,Annual Membership from Citi Bike App,Subscriber
7,830,2018-05-01 05:11:50,2018-05-01 05:25:41,3207,Oakland Ave,3185,City Hall,33624,Annual Membership,Subscriber
8,395,2018-05-01 05:12:07,2018-05-01 05:18:42,3225,Baldwin at Montgomery,3186,Grove St PATH,26300,Annual Membership,Subscriber
9,170,2018-05-01 05:13:52,2018-05-01 05:16:43,3206,Hilltop,3195,Sip Ave,33555,$25 Off Annual Membership,Subscriber

In [112]:
new_bike_data.index = ['row_'+str(i) for i in range(1, 11)]
new_bike_data

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
row_1,338,2018-05-01 00:04:47,2018-05-01 00:10:25,3639,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
row_2,1400,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
row_3,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber
row_4,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
row_5,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271,Annual Membership,Subscriber
row_6,176,2018-05-01 04:37:05,2018-05-01 04:40:01,3194,McGinley Square,3195,Sip Ave,29298,Annual Membership,Subscriber
row_7,577,2018-05-01 05:05:46,2018-05-01 05:15:23,3225,Baldwin at Montgomery,3186,Grove St PATH,33619,Annual Membership from Citi Bike App,Subscriber
row_8,830,2018-05-01 05:11:50,2018-05-01 05:25:41,3207,Oakland Ave,3185,City Hall,33624,Annual Membership,Subscriber
row_9,395,2018-05-01 05:12:07,2018-05-01 05:18:42,3225,Baldwin at Montgomery,3186,Grove St PATH,26300,Annual Membership,Subscriber
row_10,170,2018-05-01 05:13:52,2018-05-01 05:16:43,3206,Hilltop,3195,Sip Ave,33555,$25 Off Annual Membership,Subscriber

In [115]:
# df.loc[explicit_index]

new_bike_data.loc['row_2']

tripduration                          1400
starttime              2018-05-01 01:31:10
stoptime               2018-05-01 01:55:53
start station id                      3681
start station name                Grand St
end station id                        3185
end station name                 City Hall
bikeid                               33593
name_localizedValue                24 Hour
usertype                          Customer
Name: row_2, dtype: object

In [116]:
new_bike_data.loc['row_3':'row_5']

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
row_3,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber
row_4,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
row_5,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271,Annual Membership,Subscriber

In [119]:
new_bike_data.loc['row_3':'row_5', 'tripduration':'bikeid']

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid
row_3,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217
row_4,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662
row_5,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271

In [143]:
td = 200
col_name = 'tripduration'
new_bike_data.loc[(new_bike_data[col_name]>td) & 
                  (new_bike_data['usertype']=='Customer'),
                 'tripduration':'starttime'][['starttime', 'tripduration']]

                 starttime  tripduration
row_2  2018-05-01 01:31:10          1400

In [138]:
new_bike_data.iloc[::, 0:6]

,tripduration,starttime,stoptime,start station id,start station name,end station id
row_1,338,2018-05-01 00:04:47,2018-05-01 00:10:25,3639,Harborside,3199
row_2,1400,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185
row_3,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193
row_4,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186
row_5,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195
row_6,176,2018-05-01 04:37:05,2018-05-01 04:40:01,3194,McGinley Square,3195
row_7,577,2018-05-01 05:05:46,2018-05-01 05:15:23,3225,Baldwin at Montgomery,3186
row_8,830,2018-05-01 05:11:50,2018-05-01 05:25:41,3207,Oakland Ave,3185
row_9,395,2018-05-01 05:12:07,2018-05-01 05:18:42,3225,Baldwin at Montgomery,3186
row_10,170,2018-05-01 05:13:52,2018-05-01 05:16:43,3206,Hilltop,3195

# Adding and Deletikng

In [145]:
inter_org = pd.read_csv('datasets/international_org.csv')
inter_org

  Organization Name  Headquater
0               FAO        Rome
1               ICJ   The Hague
2               IMF  Washington
3            UNESCO       Paris
4               UNO    New York
5        World Bank  Washington

In [147]:
inter_org['Founded_on'] = [i for i in range(1945, 1951)]
inter_org

  Organization Name  Headquater  Founded_on
0               FAO        Rome        1945
1               ICJ   The Hague        1946
2               IMF  Washington        1947
3            UNESCO       Paris        1948
4               UNO    New York        1949
5        World Bank  Washington        1950

In [148]:
del inter_org['Founded_on']
inter_org

  Organization Name  Headquater
0               FAO        Rome
1               ICJ   The Hague
2               IMF  Washington
3            UNESCO       Paris
4               UNO    New York
5        World Bank  Washington

In [155]:
imdb_rating = pd.read_csv(r'./datasets/imdb_rating.csv')
imdb_rating

,star_rating,title,genre,duration
0,9.3,The Shawshank Redemption,Crime,142
1,9.2,The Godfather,Crime,175
2,9.1,The Godfather: Part II,Crime,200
3,9.0,The Dark Knight,Action,152
4,8.9,Pulp Fiction,Crime,154
5,8.9,12 Angry Men,Drama,96
6,8.9,"The Good, the Bad and the Ugly",Western,161
7,8.9,The Lord of the Rings: The Return of the King,Adventure,201
8,8.9,Schindler's List,Biography,195
9,8.9,Fight Club,Drama,139

In [156]:
imdb_rating.loc[-1] = [9.5, 'The Mummy', 'Horror', 200]

In [157]:
imdb_rating.index = [i+1 for i in imdb_rating.index]
imdb_rating = imdb_rating.sort_index()
imdb_rating

,star_rating,title,genre,duration
0,9.5,The Mummy,Horror,200
1,9.3,The Shawshank Redemption,Crime,142
2,9.2,The Godfather,Crime,175
3,9.1,The Godfather: Part II,Crime,200
4,9.0,The Dark Knight,Action,152
5,8.9,Pulp Fiction,Crime,154
6,8.9,12 Angry Men,Drama,96
7,8.9,"The Good, the Bad and the Ugly",Western,161
8,8.9,The Lord of the Rings: The Return of the King,Adventure,201
9,8.9,Schindler's List,Biography,195
10,8.9,Fight Club,Drama,139

In [161]:
imdb_rating.loc[-1] = [9.5, 'The Mummy', 'Horror', 200]
imdb_rating = imdb_rating.reset_index()

ValueError: cannot set a row with mismatched columns

In [164]:
imdb_rating = imdb_rating.drop(columns = ['index'])
imdb_rating

,star_rating,title,genre,duration
0,9.5,The Mummy,Horror,200
1,9.3,The Shawshank Redemption,Crime,142
2,9.2,The Godfather,Crime,175
3,9.1,The Godfather: Part II,Crime,200
4,9.0,The Dark Knight,Action,152
5,8.9,Pulp Fiction,Crime,154
6,8.9,12 Angry Men,Drama,96
7,8.9,"The Good, the Bad and the Ugly",Western,161
8,8.9,The Lord of the Rings: The Return of the King,Adventure,201
9,8.9,Schindler's List,Biography,195
10,8.9,Fight Club,Drama,139
11,9.5,The Mummy,Horror,200

In [167]:
imdb_rating.drop(imdb_rating.index[[0,11]])

,star_rating,title,genre,duration
1,9.3,The Shawshank Redemption,Crime,142
2,9.2,The Godfather,Crime,175
3,9.1,The Godfather: Part II,Crime,200
4,9.0,The Dark Knight,Action,152
5,8.9,Pulp Fiction,Crime,154
6,8.9,12 Angry Men,Drama,96
7,8.9,"The Good, the Bad and the Ugly",Western,161
8,8.9,The Lord of the Rings: The Return of the King,Adventure,201
9,8.9,Schindler's List,Biography,195
10,8.9,Fight Club,Drama,139